system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       latestTime;

startTime       0; 

stopAt          endTime;

endTime         100; //500; //2000; //1000;  

deltaT          0.0001; //0.00001; 

writeControl    adjustableRunTime;

writeInterval   0.2; //10; 

purgeWrite      0; //2; //2; 

writeFormat     binary; //ascii;

writePrecision  12;

writeCompression uncompressed; //compressed;

timeFormat      general;

timePrecision   12;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5; 
maxAlphaCo      0.5; 

maxDeltaT       1;

functions
{
    #include "faceSource_plan.cfg"
    #include "faceSource_planStl.cfg"

    amontBasFlux
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        outputControl   timeStep;
        log             false; //true;
        // Output field values as well
        valueOutput     false;
        source          patch;
        sourceName      amont_bas;
        operation       sum;

        fields
        (
            rhoPhi    
        );
    }

//   amontHautFlux
//   {
//      $amontBasFlux;
//      sourceName      amont_haut;
//   }
   
   avalBasFlux
   {
      $amontBasFlux;
      sourceName      aval_bas;
   }
   
//   avalHautFlux
//   {
//      $amontBasFlux;
//      sourceName      aval_haut;
//   }
   
   probeY2p5 
   {
     type probes
     functionObjectLibs ("libsampling.dylib");
     fields
      (
        p_rgh
      );

     probeLocations
      (
       (1.0 2.5 0.0)
       (2.0 2.5 0.0)
       (3.0 2.5 0.0)
       (4.0 2.5 0.0)
       (4.75 2.5 0.0)
       (5.25 2.5 1.0)
       (6.0 2.5 0.0)
       (7.0 2.5 0.0)
       (8.0 2.5 0.0)
       (9.0 2.5 0.0)
     );
     }
     
}

libs ( "libgroovyBC.so" ) ;

// ************************************************************************* //
