system/faceSource_planStl.cfg
    planStlFlux_X1
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        outputControl   timeStep;
        log             false; //true;
        // Output field values as well
        valueOutput     false;
        source          faceZone;
        sourceName      planStlX1;
        operation       sum;

        fields
        (
            rhoPhi    
        );
    }

    planStlFlux_X2
    {
        $planStlFlux_X1;
        sourceName      planStlX2;
    }

    planStlFlux_X3
    {
        $planStlFlux_X1;
        sourceName      planStlX3;
    }

    planStlFlux_X4
    {
        $planStlFlux_X1;
        sourceName      planStlX4;
    }

    planStlFlux_X6
    {
        $planStlFlux_X1;
        sourceName      planStlX6;
    }

    planStlFlux_X7
    {
        $planStlFlux_X1;
        sourceName      planStlX7;
    }

    planStlFlux_X8
    {
        $planStlFlux_X1;
        sourceName      planStlX8;
    }

    planStlFlux_X9
    {
        $planStlFlux_X1;
        sourceName      planStlX9;
    }

    planStlFlux_X4p75
    {
        $planStlFlux_X1;
        sourceName      planStlX4p75;
    }

    planStlFlux_X5p25
    {
        $planStlFlux_X1;
        sourceName      planStlX5p25;
    }

