system/mapFieldsDict
/*---------------------------------------------------------------------------*\
 | =========                 |                                                 |
 | \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
 |  \\    /   O peration     | Version:  1.3                                   |
 |   \\  /    A nd           | Web:      http://www.openfoam.org               |
 |    \\/     M anipulation  |                                                 |
 \*---------------------------------------------------------------------------*/
 // FoamX Case Dictionary.
 FoamFile
 {
   version         2.0;
   format          ascii;
   root            "";
   case            "";
   instance        "system";
   local           "";
   class           dictionary;
   object          mapFieldsDict;
 }

 // * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 arguments       "" "" off off off;

 patchMap
 (
 );

 cuttingPatches
 (
 );
 // ************************************************************************* //
